<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>S.U.P.E.R.M.A.N. Settings</string>
	<key>pfm_domain</key>
	<string>com.macjutsu.super</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2024-06-13T13:35:00Z</date>
	<key>pfm_macos_min</key>
	<string>11.0</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>com.macjutsu.super</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.macjutsu.super</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.macjutsu.super</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.macjutsu.super</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.macjutsu.super</string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Prompt the end user to save their password which can then be used to authenticate the local softwareupdate command</string>
			<key>pfm_name</key>
			<string>AuthAskUserToSavePassword</string>
			<key>pfm_title</key>
			<string>Auth Ask User To Save Password</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If any managed automatic authentication method fails validation, then failover to local end user authentication</string>
			<key>pfm_name</key>
			<string>AuthCredentialFailoverToUser</string>
			<key>pfm_title</key>
			<string>Auth Credential Failover To User</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The number of minutes to defer until the next update workflow attempt if a user choses not restart</string>
			<key>pfm_name</key>
			<string>DeferralTimerDefault</string>
			<key>pfm_title</key>
			<string>Deferral Timer Default</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>1440</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The number of minutes to defer if super detects an error in the workflow (for example, network or MDM connectivity issues)</string>
			<key>pfm_name</key>
			<string>DeferralTimerError</string>
			<key>pfm_title</key>
			<string>Deferral Timer Error</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>1440</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Display a deferral time pop-up menu in the non-deadline restart dialog that allows the user to override the Deferral Timer Default timer</string>
			<key>pfm_name</key>
			<string>DeferralTimerMenu</string>
			<key>pfm_title</key>
			<string>Deferral Timer Menu</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>120,1440,10080</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The number of minutes to defer if no software updates are available or allowed. Enabling this option results in super acting as a permanent agent that checks for software updates on a regular basis</string>
			<key>pfm_name</key>
			<string>DeferralTimerWorkflowRelaunch</string>
			<key>pfm_title</key>
			<string>Deferral Timer Workflow Relaunch</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>1440</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Hide the background while displaying super dialogs and notifications (ALWAYS,SOFT,HARD,INSTALLNOW,DEFER,USERAUTH,POWER)</string>
			<key>pfm_name</key>
			<string>DisplayHideBackground</string>
			<key>pfm_title</key>
			<string>Display Hide Background</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>HARD,POWER</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Display super notifications in the center of the screen (ALWAYS,SOFT,HARD,INSTALLNOW)</string>
			<key>pfm_name</key>
			<string>DisplayNotificationsCentered</string>
			<key>pfm_title</key>
			<string>Display Notifications Centered</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>ALWAYS</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Do not play the system alert sound when opening super dialogs and notifications (ALWAYS,SOFT,HARD,INSTALLNOW,DEFER,USERAUTH,POWER,STORAGE)</string>
			<key>pfm_name</key>
			<string>DisplaySilently</string>
			<key>pfm_title</key>
			<string>Display Silently</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>SOFT,HARD,INSTALLNOW,DEFER</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Disable the users ability to move super dialogs and notifications (ALWAYS,SOFT,HARD,INSTALLNOW,DEFER,USERAUTH,POWER,STORAGE)</string>
			<key>pfm_name</key>
			<string>DisplayUnmovable</string>
			<key>pfm_title</key>
			<string>Display Unmovable</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>POWER</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A plain text string or URL to open when the user clicks the warning button (exclamation mark icon) in all interactive dialogs (but not notifications)</string>
			<key>pfm_name</key>
			<string>DisplayWarningButtonString</string>
			<key>pfm_title</key>
			<string>Display Warning Button String</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>https://support.apple.com/en-us/HT201222</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A plain text string or URL to open when the user clicks the help button (question mark icon) in all interactive dialogs (but not notifications)</string>
			<key>pfm_name</key>
			<string>DisplayHelpButtonString</string>
			<key>pfm_title</key>
			<string>Display Help Button String</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>https://support.apple.com/en-us/HT201541</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>With this option enabled super leverages built-in commands and the mist command to find compatible macOS major upgrade versions. If a newer macOS major upgrade is available then the super workflow attempts to download and install the upgrade. The default super workflow always selects the newest compatible macOS major upgrade version</string>
			<key>pfm_name</key>
			<string>InstallMacOSMajorUpgrades</string>
			<key>pfm_title</key>
			<string>Install MacOS Major Upgrades</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Limit the installation of macOS major upgrade versions to the major (whole number) version specified in this option. This option requires that you have also specified the InstallMacOSMajorUpgrades option</string>
			<key>pfm_name</key>
			<string>InstallMacOSMajorVersionTarget</string>
			<key>pfm_title</key>
			<string>Install MacOS Major Version Target</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>14</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If there are no pending restart-required macOS updates or upgrades, make the super workflow install non-system Apple software updates as soon as they become available</string>
			<key>pfm_name</key>
			<string>InstallNonSystemUpdatesWithoutRestarting</string>
			<key>pfm_title</key>
			<string>Install Non System Updates Without Restarting</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allow the super workflow to install macOS Rapid Security Response (RSR) updates</string>
			<key>pfm_name</key>
			<string>InstallRapidSecurityResponses</string>
			<key>pfm_title</key>
			<string>Install Rapid Security Responses</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Disable the automatic relaunch of the super workflow when no macOS updates or upgrades are available or allowed</string>
			<key>pfm_name</key>
			<string>WorkflowDisableRelaunch</string>
			<key>pfm_title</key>
			<string>Workflow Disable Relaunch</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Disable the super workflow from checking for, downloading, or installing any Apple software updates or upgrades, even if they are available</string>
			<key>pfm_name</key>
			<string>WorkflowDisableUpdateCheck</string>
			<key>pfm_title</key>
			<string>Workflow Disable Update Check</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Download and prepare macOS updates or upgrades but do not start any installation workflow</string>
			<key>pfm_name</key>
			<string>WorkflowOnlyDownload</string>
			<key>pfm_title</key>
			<string>Workflow Only Download</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Generate additional debugging output to the command line and various super logs</string>
			<key>pfm_name</key>
			<string>VerboseMode</string>
			<key>pfm_title</key>
			<string>Verbose Mode</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>S.U.P.E.R.M.A.N</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>2</integer>
</dict>
</plist>
